Tekla Open API Reference for Tekla Structures 2025
Operation.Open Method (String, Boolean)
Note: This API is now obsolete.
Opens a new model to Tekla Structures.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Use the method in ModelHandler class instead. Will be removed in near future.")]
public static bool Open(
	string ModelFolder,
	bool OpenAutoSaved
)
<ObsoleteAttribute("Use the method in ModelHandler class instead. Will be removed in near future.")>
Public Shared Function Open (
	ModelFolder As String,
	OpenAutoSaved As Boolean
) As Boolean
Parameters
ModelFolder
Type: System.String
The model folder to be used.
OpenAutoSaved
Type: System.Boolean
Tells whether to open auto saved information or not.
Return Value
Type: Boolean
True on success.
See Also
Reference
Operation Class
Open Overload
Tekla.Structures.Model.Operations Namespace